Revit 2027 API
BuiltInFailures.RebarSystemFailures.PathReinforcementWrongHost Property
 Path Reinforcement can be placed only in Structural Floors and straight Structural Walls.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PathReinforcementWrongHost { get; }
Public Shared ReadOnly Property PathReinforcementWrongHost As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PathReinforcementWrongHost {
	FailureDefinitionId^ get ();
}
static member PathReinforcementWrongHost : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace